#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_iam_role.eks_node_role: Refreshing state... [id=eks_node_role]
aws_vpc.main: Refreshing state... [id=vpc-01b577384d221fe3d]
aws_iam_role.eks_role: Refreshing state... [id=eks_role]
aws_iam_role_policy_attachment.eks_policy_attachment: Refreshing state... [id=eks_role-20230823124538236800000002]
aws_iam_role_policy_attachment.eks_node_policy_attachment_worker: Refreshing state... [id=eks_node_role-20230824074510553200000002]
aws_iam_role_policy_attachment.eks_node_policy_attachment_container: Refreshing state... [id=eks_node_role-20230824074510515100000001]
aws_subnet.private_1: Refreshing state... [id=subnet-0ad346e21fd80cb9a]
aws_subnet.public_1: Refreshing state... [id=subnet-0d6339c81dca217aa]
aws_subnet.public_2: Refreshing state... [id=subnet-0a8801e13bb79f167]
aws_security_group.eks_security_group: Refreshing state... [id=sg-0f1b771c4bf6f2262]
aws_subnet.private_2: Refreshing state... [id=subnet-06fb5c9945d02b01c]
aws_eks_cluster.my_cluster: Refreshing state... [id=my-cluster]
aws_eks_node_group.my_node_group: Refreshing state... [id=my-cluster:my-node-group]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_eks_node_group.my_node_group is tainted, so must be replaced
-/+ resource "aws_eks_node_group" "my_node_group" {
      ~ ami_type               = "AL2_x86_64" -> (known after apply)
      ~ arn                    = "arn:aws:eks:eu-north-1:459978891776:nodegroup/my-cluster/my-node-group/94c51345-daa0-be99-8258-c8f3eb887fb8" -> (known after apply)
      ~ capacity_type          = "ON_DEMAND" -> (known after apply)
      ~ disk_size              = 20 -> (known after apply)
      ~ id                     = "my-cluster:my-node-group" -> (known after apply)
      ~ instance_types         = [
          - "t3.medium",
        ] -> (known after apply)
      - labels                 = {} -> null
      + node_group_name_prefix = (known after apply)
      ~ release_version        = "1.27.3-20230816" -> (known after apply)
      ~ resources              = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-my-node-group-94c51345-daa0-be99-8258-c8f3eb887fb8"
                    },
                ]
              - remote_access_security_group_id = ""
            },
        ] -> (known after apply)
      ~ status                 = "CREATE_FAILED" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      ~ version                = "1.27" -> (known after apply)
        # (4 unchanged attributes hidden)

      ~ update_config {
          ~ max_unavailable            = 1 -> (known after apply)
          ~ max_unavailable_percentage = 0 -> (known after apply)
        }

        # (1 unchanged block hidden)
    }

  # aws_iam_role_policy_attachment.eks_node_policy_attachment_cni will be created
  + resource "aws_iam_role_policy_attachment" "eks_node_policy_attachment_cni" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = "eks_node_role"
    }

Plan: 2 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @Gluppe, Action: `pull_request`*